_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеМатериаловПоРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_РаспределениеМатериаловПоРаботам</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ПланыПотребностейВМатериалах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ПланыПотребностейВМатериалах</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПланаПотребности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_ВидыОперацийПланаПотребности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Факт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтроительнаяРабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/СтатусыПриходныхОрдеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПриходныхОрдеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КПоступлению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОбработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_РаспределениеМатериаловПоРаботам/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);	
	Период.Вариант = ВариантСтандартногоПериода.Вчера;
	ДатаПотребности = КонецМесяца(ТекущаяДата());
	//ТолькоНераспределенные = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если Склад<> ТекущийСклад Тогда	
	ЗаполнитьТаблицуДокументов();
	ТекущийСклад = Склад;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПотребностиПриИзменении(Элемент)
ЗаполнитьТаблицуДокументов();	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)  

ЗаполнитьТаблицуДокументов();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоДанныхНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоДанных");
	Дерево.Строки.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Склад.УСОERP_ОбъектСтроительства) ИЛИ 
		Склад.УСОERP_ОбъектСтроительства.УСОERP_ВестиРаспределениеМатериаловПоРаботам = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок = РеквизитФормыВЗначение("ТаблицаДокументов");
	
	МассивДокументов = ТабДок.Скопировать(Новый Структура("Отбор",Истина)).ВыгрузитьКолонку("Документ");
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
	Запрос.УстановитьПараметр("ОбъектСтроительства",Склад.УСОERP_ОбъектСтроительства);
	Запрос.УстановитьПараметр("ДатаПотребности",КонецДня(ДатаПотребности));
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("ТолькоНераспределенные",ТолькоНераспределенные);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ПоступлениеТоваровУслугТовары.Номенклатура,
	|	СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВрТабМожноРаспределить
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|ГДЕ
	|	ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|	И ПоступлениеТоваровУслугТовары.Назначение.Заказ.ДокументОснование.ОбъектСтроительства = &ОбъектСтроительства
	|	И ПоступлениеТоваровУслугТовары.Назначение.Заказ.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеТоваровУслугТовары.Характеристика,
	|	ПоступлениеТоваровУслугТовары.Номенклатура
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|	СУММА(ПриходныйОрдерНаТоварыТовары.Количество)
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|ГДЕ
	|	ПриходныйОрдерНаТоварыТовары.Ссылка В(&МассивДокументов)
	|	И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование.ОбъектСтроительства = &ОбъектСтроительства
	|	И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование.Склад = &Склад
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриходныйОрдерНаТоварыТовары.Характеристика,
	|	ПриходныйОрдерНаТоварыТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Работа,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Номенклатура,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Характеристика,
	|	СУММА(УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Количество) КАК КоличествоПотребность,
	|	0 КАК КоличествоОборот,
	|	0 КАК КоличествоПотребностьОбщая
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	РегистрСведений.УСОERP_ПланыПотребностейВМатериалах.СрезПоследних(
	|			,
	|			Склад = &Склад
	|				И ДатаПлана <= &ДатаПотребности) КАК УСОERP_ПланыПотребностейВМатериалахСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Работа,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Номенклатура,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.СтроительнаяРабота,
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.Номенклатура,
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.Характеристика,
	|	0,
	|	СУММА(УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.КоличествоОборот),
	|	0
	|ИЗ
	|	РегистрНакопления.УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботам.Обороты(
	|			,
	|			,
	|			Авто,
	|			ОбъектСтроительства = &ОбъектСтроительства
	|				И Факт = ИСТИНА
	|				И Склад = &Склад) КАК УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоНераспределенные
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ НЕ УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.Регистратор В (&МассивДокументов)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.СтроительнаяРабота,
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.Номенклатура,
	|	УСОERP_ЗакупленныеМатериалыПоОбъектамСтроительстваПоРаботамОбороты.Характеристика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Работа,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Номенклатура,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Характеристика,
	|	0,
	|	0,
	|	УСОERP_ПланыПотребностейВМатериалахСрезПоследних.Количество
	|ИЗ
	|	РегистрСведений.УСОERP_ПланыПотребностейВМатериалах.СрезПоследних(, Склад = &Склад) КАК УСОERP_ПланыПотребностейВМатериалахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Работа,
	|	ВрТаб.Номенклатура,
	|	ВрТаб.Характеристика,
	|	СУММА(ВрТаб.КоличествоПотребность) КАК КоличествоПотребность,
	|	СУММА(ВрТаб.КоличествоОборот) КАК КоличествоВНаличии,
	|	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.КоличествоМожноРаспределить, 0)) КАК КоличествоМожноРаспределить,
	|	СУММА(ВрТаб.КоличествоПотребностьОбщая) КАК КоличествоПотребностьОбщая,
	|	ВрТаб.Работа.КодСДР КАК КодСДР
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВрТабМожноРаспределить.Характеристика КАК Характеристика,
	|			ВрТабМожноРаспределить.Номенклатура КАК Номенклатура,
	|			СУММА(ВрТабМожноРаспределить.Количество) КАК КоличествоМожноРаспределить
	|		ИЗ
	|			ВрТабМожноРаспределить КАК ВрТабМожноРаспределить
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВрТабМожноРаспределить.Характеристика,
	|			ВрТабМожноРаспределить.Номенклатура) КАК ВложенныйЗапрос
	|		ПО ВрТаб.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ВрТаб.Характеристика = ВложенныйЗапрос.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаб.Работа,
	|	ВрТаб.Номенклатура,
	|	ВрТаб.Характеристика";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.НазначениеЗаказ КАК Заказ
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугТовары.Назначение.Заказ КАК НазначениеЗаказ
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		И ПоступлениеТоваровУслугТовары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
	|		И ПоступлениеТоваровУслугТовары.Назначение.Заказ.ДокументОснование.Склад = &Склад
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриходныйОрдерНаТоварыТовары.Назначение.Заказ
	|	ИЗ
	|		Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|	ГДЕ
	|		ПриходныйОрдерНаТоварыТовары.Ссылка В(&МассивДокументов)
	|		И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование.Склад = &Склад
	|		И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.НазначениеЗаказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура КАК Номенклатура,
	|	ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВрТаб_Работы
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказМатериаловВПроизводство.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам
	|		ПО ВрТаб.Заказ = ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура,
	|	ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Характеристика
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаВнутреннееПотребление.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам
	|		ПО ВрТаб.Заказ = ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб_Работы.СтроительнаяРабота КАК Работа,
	|	ВрТаб_Работы.Номенклатура,
	|	ВрТаб_Работы.Характеристика
	|ИЗ
	|	ВрТаб_Работы КАК ВрТаб_Работы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаб_Работы.Характеристика,
	|	ВрТаб_Работы.СтроительнаяРабота,
	|	ВрТаб_Работы.Номенклатура";
	
	ТаблицаНаличияРабот = Запрос.Выполнить().Выгрузить();
	
	ТабНоменклатуры = ТЗ.Скопировать();
	ТабНоменклатуры.Свернуть("Номенклатура,Характеристика,КоличествоМожноРаспределить","КоличествоПотребностьОбщая,КоличествоПотребность,КоличествоВНаличии");
	
	СтруктураОтбора = Новый Структура("Номенклатура,Характеристика");
	СтруктураОтбораРаботы = Новый Структура("Номенклатура,Характеристика,Работа");
	
	Для Каждого СтрокаНоменклатуры ИЗ ТабНоменклатуры Цикл
		
		Если СтрокаНоменклатуры.КоличествоМожноРаспределить = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,СтрокаНоменклатуры);
		
		СтрокаДерева = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева,СтрокаНоменклатуры);
		СтрокаДерева.НоменклатураРабота = СтрокаНоменклатуры.Номенклатура;
		
		
		ТабРабот = ТЗ.Скопировать(СтруктураОтбора);
		ТабРабот.Сортировать("КодСДР");
		
		Для Каждого СтрокаРабот ИЗ ТабРабот Цикл
			
			ПодСтрока = СтрокаДерева.Строки.Добавить();
			ПодСтрока.НоменклатураРабота = СтрокаРабот.Работа;
			ПодСтрока.Характеристика = СтрокаРабот.Работа.КодСДР;
			ПодСтрока.КоличествоПотребность = СтрокаРабот.КоличествоПотребность;
			ПодСтрока.КоличествоПотребностьОбщая = СтрокаРабот.КоличествоПотребностьОбщая;
			ПодСтрока.КоличествоВНаличии = СтрокаРабот.КоличествоВНаличии; 
			ЗаполнитьЗначенияСвойств(СтруктураОтбораРаботы,СтрокаРабот);
			ПодСтрока.ЕстьВЗаказе = ТаблицаНаличияРабот.НайтиСтроки(СтруктураОтбораРаботы).Количество();
			ПодСтрока.КоличествоПотребностьМинусВНаличии = ПодСтрока.КоличествоПотребность-ПодСтрока.КоличествоВНаличии;
			ПодСтрока.УровеньСтроки = 1;
			
		КонецЦикла;	
		
		Если ТабРабот.Количество() = 1 Тогда
			
			ПодСтрока.КоличествоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
			СтрокаДерева.КоличествоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
			СтрокаДерева.Распределено = Истина;
			
		ИначеЕсли СтрокаДерева.КоличествоМожноРаспределить = ТабРабот.Итог("КоличествоПотребность") - ТабРабот.Итог("КоличествоВНаличии") Тогда
			
			СтрокаДерева.КоличествоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
			СтрокаДерева.Распределено = Истина;
			
			Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
				ПодСтрока.КоличествоРаспределить = ПодСтрока.КоличествоПотребность-ПодСтрока.КоличествоВНаличии;
			КонецЦикла; 			
				
		КонецЕсли;		
		
	КонецЦикла;
	
   ЗначениеВРеквизитФормы(Дерево,"ДеревоДанных");
   
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДокументов()
	
	ДеревоДанных.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("ДатаНачала",Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания",Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ТолькоНераспределенные",ТолькоНераспределенные);
			
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК Ссылка,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	|	СУММА(ВложенныйЗапрос.КоличествоРаспределено) КАК КоличествоРаспределено,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.Количество) = СУММА(ВложенныйЗапрос.КоличествоРаспределено)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Распределено
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПТУ_Товары.Ссылка КАК Ссылка,
	|		ПТУ_Товары.Номенклатура КАК Номенклатура,
	|		ПТУ_Товары.Характеристика КАК Характеристика,
	|		ПТУ_Товары.Количество КАК Количество,
	|		0 КАК КоличествоРаспределено
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ПТУ_Товары
	|	ГДЕ
	|		(ПТУ_Товары.Назначение.Заказ ССЫЛКА Документ.ЗаказМатериаловВПроизводство
	|				ИЛИ ПТУ_Товары.Назначение.Заказ ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
	|		И ПТУ_Товары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
	|		И ПТУ_Товары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И ПТУ_Товары.Ссылка.Склад = &Склад
	|		И ПТУ_Товары.Ссылка.Проведен
	|		И (ПТУ_Товары.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = ЛОЖЬ
	|				ИЛИ ПТУ_Товары.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = ИСТИНА
	|					И ПТУ_Товары.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении > ПТУ_Товары.Ссылка.Дата)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПТУ_Работы.Ссылка,
	|		ПТУ_Работы.Номенклатура,
	|		ПТУ_Работы.Характеристика,
	|		0,
	|		ПТУ_Работы.Количество
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.УСОERP_РаспределениеМатериаловПоРаботам КАК ПТУ_Работы
	|	ГДЕ
	|		ПТУ_Работы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И ПТУ_Работы.Ссылка.Склад = &Склад
	|		И ПТУ_Работы.Ссылка.Проведен
	|		И (ПТУ_Работы.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = ЛОЖЬ
	|				ИЛИ ПТУ_Работы.Ссылка.Склад.ИспользоватьОрдернуюСхемуПриПоступлении = ИСТИНА
	|					И ПТУ_Работы.Ссылка.Склад.ДатаНачалаОрдернойСхемыПриПоступлении > ПТУ_Работы.Ссылка.Дата)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПОТ_Товары.Ссылка,
	|		ПОТ_Товары.Номенклатура,
	|		ПОТ_Товары.Характеристика,
	|		ПОТ_Товары.Количество,
	|		0
	|	ИЗ
	|		Документ.ПриходныйОрдерНаТовары.Товары КАК ПОТ_Товары
	|	ГДЕ
	|		ПОТ_Товары.Ссылка.Проведен
	|		И ПОТ_Товары.Ссылка.Склад = &Склад
	|		И ПОТ_Товары.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)
	|		И ПОТ_Товары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
	|		И ПОТ_Товары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И (ПОТ_Товары.Назначение.Заказ ССЫЛКА Документ.ЗаказМатериаловВПроизводство
	|				ИЛИ ПОТ_Товары.Назначение.Заказ ССЫЛКА Документ.ЗаказНаВнутреннееПотребление)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПОТ_Работы.Ссылка,
	|		ПОТ_Работы.Номенклатура,
	|		ПОТ_Работы.Характеристика,
	|		0,
	|		ПОТ_Работы.Количество
	|	ИЗ
	|		Документ.ПриходныйОрдерНаТовары.УСОERP_РаспределениеМатериаловПоРаботам КАК ПОТ_Работы
	|	ГДЕ
	|		ПОТ_Работы.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И ПОТ_Работы.Ссылка.Склад = &Склад
	|		И ПОТ_Работы.Ссылка.Проведен
	|		И ПОТ_Работы.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПриходныхОрдеров.Принят)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Ссылка,
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Ссылка КАК Документ,
	|	ИСТИНА КАК Отбор,
	|	МИНИМУМ(ВрТаб.Распределено) КАК Распределен,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВрТаб.КоличествоРаспределено > 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК БылоРаспределение
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &ТолькоНераспределенные
	|				ТОГДА ВрТаб.Распределено = ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВрТаб.Ссылка"; 	
	
	ТабДокументов = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТабДокументов,"ТаблицаДокументов"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоДанных(Команда)
	ЗаполнитьДеревоДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНераспределеннныеПриИзменении(Элемент)
	ЗаполнитьТаблицуДокументов();
КонецПроцедуры

&НаСервере
Процедура КомандаРаспределитьНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоДанных");
	
	СтруктураЕстьВЗаказе = Новый Структура("ЕстьВЗаказе",Истина);
	СтруктураНетВЗаказе = Новый Структура("ЕстьВЗаказе",Ложь);
	СтруктураНетПотребности = Новый Структура("КоличествоПотребность",0);
	СтруктураПотребностьЗакрыта = Новый Структура("КоличествоПотребностьМинусВНаличии",0);
	
	Для Каждого СтрокаДерева ИЗ Дерево.Строки Цикл
		
		Если СтрокаДерева.КоличествоМожноРаспределить > СтрокаДерева.КоличествоПотребностьОбщая-СтрокаДерева.КоличествоВНаличии Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Строки.Количество() = 1 Тогда
			
			ПодСтрока = СтрокаДерева.Строки.Получить(0);
			ПодСтрока.КоличествоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
			СтрокаДерева.Распределено = Истина;
			СтрокаДерева.КоличествоРаспределить = ПодСтрока.КоличествоРаспределить;
			Продолжить;
			
		КонецЕсли;		
		
		НадоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
		
		//сначала закрываем потребности, если есть.
		
		СтрокиЕстьВЗаказе = СтрокаДерева.Строки.НайтиСтроки(СтруктураЕстьВЗаказе);
		СтрокиНетПотребности = СтрокаДерева.Строки.НайтиСтроки(СтруктураНетПотребности);
		СтрокиПотребностьЗакрыта = СтрокаДерева.Строки.НайтиСтроки(СтруктураПотребностьЗакрыта);
		
		НадоРаспределитьПоСтрокам = 0;
		
		СтрокиДляПервогоРаспределения = Новый Массив;
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиЕстьВЗаказе Цикл
			
			Если СтрокиНетПотребности.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии;
				Продолжить;
			КонецЕсли;
			
			Если СтрокиПотребностьЗакрыта.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии;
				Продолжить;
			КонецЕсли; 	
			
			СтрокиДляПервогоРаспределения.Добавить(СтрокаЕстьВЗаказе);
			
			НадоРаспределитьПоСтрокам = НадоРаспределитьПоСтрокам+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии;
			
		КонецЦикла;		
		
		Если НадоРаспределитьПоСтрокам < НадоРаспределить Тогда
			
			Коэффициент = 1;
			
		Иначе
			
			Коэффициент = НадоРаспределить/НадоРаспределитьПоСТрокам;
			
		КонецЕсли;
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиДляПервогоРаспределения Цикл
			
			СтрокаЕстьВЗаказе.КоличествоРаспределить = СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			НадоРаспределить = НадоРаспределить-СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СТрокаЕстьВЗаказе.КоличествоВНаличии-СтрокаЕстьВЗаказе.КоличествоРаспределить;
			
		КонецЦикла;
		
		НадоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
		КоличествоРаспределить = 0;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			НадоРаспределить = НадоРаспределить - ПодСтрока.КоличествоРаспределить;
			КоличествоРаспределить = КоличествоРаспределить+ПодСтрока.КоличествоРаспределить;
			
		КонецЦикла;
		
		Если НадоРаспределить = 0 Тогда
			
			СтрокаДерева.КоличествоРаспределить = КоличествоРаспределить;
			
			Продолжить;
		КонецЕсли; 		
				
		//остаток делим между строками, которые есть в заказе, но без потребности
		СтрокиПотребностьЗакрыта = СтрокаДерева.Строки.НайтиСтроки(СтруктураПотребностьЗакрыта);
		
		НадоРаспределитьПоСтрокам = 0;
		
		СтрокиДляПервогоРаспределения.Очистить();
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиЕстьВЗаказе Цикл
			
			Если СтрокиПотребностьЗакрыта.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НадоРаспределитьПоСтрокам = НадоРаспределитьПоСтрокам+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии;
			СтрокиДляПервогоРаспределения.Добавить(СтрокаЕстьВЗаказе);
			
		КонецЦикла; 		
		
		Если НадоРаспределитьПоСтрокам < НадоРаспределить Тогда
			
			Коэффициент = 1;
			
		Иначе
			
			Коэффициент = НадоРаспределить/НадоРаспределитьПоСТрокам;			
			
		КонецЕсли; 		
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиДляПервогоРаспределения Цикл
			
			СтрокаЕстьВЗаказе.КоличествоРаспределить = СтрокаЕстьВЗаказе.КоличествоРаспределить+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			НадоРаспределить = НадоРаспределить-СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			
			СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии-СтрокаЕстьВЗаказе.КоличествоРаспределить;			
			
		КонецЦикла;  
		
		НадоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
		КоличествоРаспределить = 0;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			НадоРаспределить = НадоРаспределить - ПодСтрока.КоличествоРаспределить;
			КоличествоРаспределить = КоличествоРаспределить+ПодСтрока.КоличествоРаспределить;
			
		КонецЦикла;
		
		Если НадоРаспределить = 0 Тогда
			
			СтрокаДерева.КоличествоРаспределить = КоличествоРаспределить;  			
			Продолжить;
			
		КонецЕсли;
		
		//остаток делим на все, что осталось, а осталось только то, что в заказы не входит.. Кажется			
		//То же самое 		
		//сначала закрываем потребности, если есть.
		
		СтрокиЕстьВЗаказе = СтрокаДерева.Строки.НайтиСтроки(СтруктураНетВЗаказе);
		СтрокиНетПотребности = СтрокаДерева.Строки.НайтиСтроки(СтруктураНетПотребности);
		СтрокиПотребностьЗакрыта = СтрокаДерева.Строки.НайтиСтроки(СтруктураПотребностьЗакрыта);
		
		НадоРаспределитьПоСтрокам = 0;
		
		СтрокиДляПервогоРаспределения = Новый Массив;
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиЕстьВЗаказе Цикл
			
			Если СтрокиНетПотребности.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				
				СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии;
				Продолжить;
				
			КонецЕсли;
			
			Если СтрокиПотребностьЗакрыта.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				
				СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии;
				Продолжить;
				
			КонецЕсли; 	
			
			СтрокиДляПервогоРаспределения.Добавить(СтрокаЕстьВЗаказе);
			
			НадоРаспределитьПоСтрокам = НадоРаспределитьПоСтрокам+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии;
			
		КонецЦикла;	
		
		Если НадоРаспределитьПоСтрокам Тогда
		
		Если НадоРаспределитьПоСтрокам < НадоРаспределить Тогда
			
			Коэффициент = 1;
			
		Иначе
			
			Коэффициент = НадоРаспределить/НадоРаспределитьПоСТрокам;
			
		КонецЕсли;
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиДляПервогоРаспределения Цикл
			
			СтрокаЕстьВЗаказе.КоличествоРаспределить = СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			НадоРаспределить = НадоРаспределить-СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СТрокаЕстьВЗаказе.КоличествоВНаличии-СтрокаЕстьВЗаказе.КоличествоРаспределить;
			
		КонецЦикла;
		
		КонецЕсли;
		
		НадоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
		КоличествоРаспределить = 0;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			НадоРаспределить = НадоРаспределить - ПодСтрока.КоличествоРаспределить;
			КоличествоРаспределить = КоличествоРаспределить+ПодСтрока.КоличествоРаспределить;
			
		КонецЦикла;
		
		//Если НадоРаспределить <= 0 Тогда
			
		Если НадоРаспределить = 0 Тогда
			
			СтрокаДерева.КоличествоРаспределить = КоличествоРаспределить+(0+НадоРаспределить);
					
			Продолжить;
			
		КонецЕсли; 
		
		//остаток делим между строками, которые есть в заказе, но без потребности
		СтрокиПотребностьЗакрыта = СтрокаДерева.Строки.НайтиСтроки(СтруктураПотребностьЗакрыта);
		
		НадоРаспределитьПоСтрокам = 0;
		
		СтрокиДляПервогоРаспределения.Очистить();
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиЕстьВЗаказе Цикл
			
			Если СтрокиПотребностьЗакрыта.Найти(СтрокаЕстьВЗаказе) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НадоРаспределитьПоСтрокам = НадоРаспределитьПоСтрокам+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии;
			СтрокиДляПервогоРаспределения.Добавить(СтрокаЕстьВЗаказе);
			
		КонецЦикла; 		
		
		Если НадоРаспределитьПоСтрокам < НадоРаспределить Тогда
			
			Коэффициент = 1;
			
		Иначе
			
			Коэффициент = НадоРаспределить/НадоРаспределитьПоСТрокам;			
			
		КонецЕсли; 		
		
		Для Каждого СтрокаЕстьВЗаказе ИЗ СтрокиДляПервогоРаспределения Цикл
			
			СтрокаЕстьВЗаказе.КоличествоРаспределить = СтрокаЕстьВЗаказе.КоличествоРаспределить+СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			НадоРаспределить = НадоРаспределить-СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии*Коэффициент;
			
			СтрокаЕстьВЗаказе.КоличествоПотребностьМинусВНаличии = СтрокаЕстьВЗаказе.КоличествоПотребностьОбщая-СтрокаЕстьВЗаказе.КоличествоВНаличии-СтрокаЕстьВЗаказе.КоличествоРаспределить;			
			
		КонецЦикла; 
		
		НадоРаспределить = СтрокаДерева.КоличествоМожноРаспределить;
		КоличествоРаспределить = 0;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			НадоРаспределить = НадоРаспределить - ПодСтрока.КоличествоРаспределить;
			КоличествоРаспределить = КоличествоРаспределить+ПодСтрока.КоличествоРаспределить;
			
		КонецЦикла;
		
		СтрокаДерева.КоличествоРаспределить = 0;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			СтрокаДерева.КоличествоРаспределить = СтрокаДерева.КоличествоРаспределить+ПодСтрока.КоличествоРаспределить;
			
		КонецЦикла;
		
		Разница = СтрокаДерева.КоличествоМожноРаспределить - СтрокаДерева.КоличествоРаспределить;
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			Если ПодСтрока.КоличествоРаспределить+Разница >= 0 Тогда
				
				ПодСтрока.КоличествоРаспределить = ПодСтрока.КоличествоРаспределить+Разница;
				СтрокаДерева.КоличествоРаспределить = СтрокаДерева.КоличествоРаспределить+Разница;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;   
		
	КонецЦикла;
	
	Для Каждого СтрокаДерева ИЗ Дерево.Строки Цикл
		
		СтрокаДерева.Распределено = СтрокаДерева.КоличествоМожноРаспределить = СтрокаДерева.КоличествоРаспределить;
		
	КонецЦикла;  	
	
	ЗначениеВРеквизитФормы(Дерево,"ДеревоДанных");
	
КонецПроцедуры

Процедура РазвернутьРаботыПоДатам()
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	ЗаполнитьДеревоДанныхНаСервере(); 
	КомандаРаспределитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхКоличествоРаспределитьПриИзменении(Элемент)
	
	ТекСтрока = Элементы.ДеревоДанных.ТекущиеДанные;
	ТекСтрока.КоличествоРаспределить = Мин(ТекСтрока.КоличествоПотребностьОбщая-ТекСтрока.КоличествоВНаличии,ТекСтрока.КоличествоРаспределить);
	
	Ид = Элементы.ДеревоДанных.ТекущиеДанные.ПолучитьИдентификатор();
	ПересчитатьСуммуВСтрокеДерева(Ид);
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСуммуВСтрокеДерева(Ид)
	
	СтрокаДерева = ДеревоДанных.НайтиПоИдентификатору(Ид);
	
	Родитель = СтрокаДерева.ПолучитьРодителя();
	
	Родитель.КоличествоРаспределить = 0;
	
	Для Каждого ПодСтрока ИЗ Родитель.ПолучитьЭлементы() Цикл
		
		Родитель.КоличествоРаспределить = Родитель.КоличествоРаспределить+ПодСтрока.КоличествоРаспределить; 	
		
	КонецЦикла;
	
	Если Родитель.КоличествоРаспределить > Родитель.КоличествоМожноРаспределить Тогда		
		
		СтрокаДерева.КоличествоРаспределить = СтрокаДерева.КоличествоРаспределить- (Родитель.КоличествоРаспределить - Родитель.КоличествоМожноРаспределить);
		
		Родитель.КоличествоРаспределить = Родитель.КоличествоМожноРаспределить;  
		
	КонецЕсли;
	
	Родитель.Распределено = Родитель.КоличествоРаспределить=Родитель.КоличествоМожноРаспределить;  	
	
КонецПроцедуры

&НаСервере
Процедура КомандаПеренестиВДокументыНаСервере()
	
	Дерево = РеквизитФормыВЗначение("ДеревоДанных");
	Строки = Дерево.Строки.НайтиСтроки(Новый Структура("Распределено",Ложь));
	ТабДокументов = РеквизитФормыВЗначение("ТаблицаДокументов");
	
	Если Строки.Количество() Тогда
		
		Сообщить("Не все материалы распределены!");
		Возврат;
		
	КонецЕсли;
	
	ОбъектСтроительства = Склад.УСОERP_ОбъектСтроительства;
	
	ТаблицаНоменклатурыРабот = Новый ТаблицаЗначений;
	ТаблицаНоменклатурыРабот.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаНоменклатурыРабот.Колонки.Добавить("Характеристика",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаНоменклатурыРабот.Колонки.Добавить("Работа",Новый ОписаниеТипов("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	ТаблицаНоменклатурыРабот.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	ТаблицаНоменклатурыРабот.Колонки.Добавить("КоличествоНоменклатуры",Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаДерева ИЗ Дерево.Строки Цикл  	
		
		Для Каждого ПодСтрока ИЗ СтрокаДерева.Строки Цикл
			
			Если НЕ ПодСтрока.КоличествоРаспределить Тогда
				Продолжить;
			КонецЕсли;
			
			Нстр = ТаблицаНоменклатурыРабот.Добавить();
			Нстр.Номенклатура = СтрокаДерева.НоменклатураРабота;
			Нстр.Характеристика = СтрокаДерева.Характеристика;
			Нстр.Работа = ПодСтрока.НоменклатураРабота;
			Нстр.Количество = ПодСтрока.КоличествоРаспределить;
			Нстр.КоличествоНоменклатуры = СтрокаДерева.КоличествоРаспределить;
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("ТабНом",ТаблицаНоменклатурыРабот);
	МассивДокументов = ТабДокументов.Скопировать(Новый Структура("Отбор",Истина)).ВыгрузитьКолонку("Документ");
	Запрос.УстановитьПараметр("МассивДокументов",МассивДокументов);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВрТаб.Номенклатура КАК Номенклатура,
	|	ВрТаб.Характеристика КАК Характеристика,
	|	ВрТаб.Работа КАК Работа,
	|	ВрТаб.Количество КАК Количество,
	|	ВрТаб.КоличествоНоменклатуры КАК КоличествоНоменклатуры
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТабНом КАК ВрТаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТоваров.ДокументПоступления КАК ДокументПоступления,
	|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ТаблицаТоваров.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.СтроительнаяРабота КАК СтроительнаяРабота,
	|	ТаблицаТоваров.Количество КАК Количество,
	|	СУММА(ВложенныйЗапрос.Количество) КАК КоличествоПлан
	|ПОМЕСТИТЬ ТабПоДокументам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ПоступлениеТоваровУслугТовары.Номенклатура КАК Номенклатура,
	|		ПоступлениеТоваровУслугТовары.Характеристика КАК Характеристика,
	|		СУММА(ПоступлениеТоваровУслугТовары.Количество) КАК Количество,
	|		ПоступлениеТоваровУслугТовары.Назначение.Заказ КАК НазначениеЗаказ,
	|		ПоступлениеТоваровУслугТовары.Ссылка КАК ДокументПоступления
	|	ИЗ
	|		Документ.ПриобретениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	|	ГДЕ
	|		ПоступлениеТоваровУслугТовары.Ссылка В(&МассивДокументов)
	|		И ПоступлениеТоваровУслугТовары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
	|		И ПоступлениеТоваровУслугТовары.Назначение.Заказ.ДокументОснование.Склад = &Склад
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ПоступлениеТоваровУслугТовары.Номенклатура,
	|		ПоступлениеТоваровУслугТовары.Характеристика,
	|		ПоступлениеТоваровУслугТовары.Назначение.Заказ,
	|		ПоступлениеТоваровУслугТовары.Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриходныйОрдерНаТоварыТовары.Номенклатура,
	|		ПриходныйОрдерНаТоварыТовары.Характеристика,
	|		ПриходныйОрдерНаТоварыТовары.Количество,
	|		ПриходныйОрдерНаТоварыТовары.Назначение.Заказ,
	|		ПриходныйОрдерНаТоварыТовары.Ссылка
	|	ИЗ
	|		Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	|	ГДЕ
	|		ПриходныйОрдерНаТоварыТовары.Ссылка В(&МассивДокументов)
	|		И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование ССЫЛКА Документ.УСОERP_ПланПотребностейВМатериалах
	|		И ПриходныйОрдерНаТоварыТовары.Назначение.Заказ.ДокументОснование.Склад = &Склад) КАК ТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Ссылка КАК Ссылка,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура КАК Номенклатура,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Характеристика КАК Характеристика,
	|			СУММА(ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Количество) КАК Количество,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота КАК СтроительнаяРабота
	|		ИЗ
	|			Документ.ЗаказМатериаловВПроизводство.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам
	|		ГДЕ
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Ссылка.Проведен
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Ссылка,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.Характеристика,
	|			ЗаказМатериаловВПроизводствоУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота
	|		
	|		ОБЪЕДИНИТЬ ВСЕ
	|		
	|		ВЫБРАТЬ
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Ссылка,
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Номенклатура,
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Характеристика,
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Количество,
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.СтроительнаяРабота
	|		ИЗ
	|			Документ.ЗаказНаВнутреннееПотребление.УСОERP_РаспределениеМатериаловПоРаботам КАК ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам
	|		ГДЕ
	|			ЗаказНаВнутреннееПотреблениеУСОERP_РаспределениеМатериаловПоРаботам.Ссылка.Проведен) КАК ВложенныйЗапрос
	|		ПО ТаблицаТоваров.Номенклатура = ВложенныйЗапрос.Номенклатура
	|			И ТаблицаТоваров.Характеристика = ВложенныйЗапрос.Характеристика
	|			И ТаблицаТоваров.НазначениеЗаказ = ВложенныйЗапрос.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.Номенклатура,
	|	ТаблицаТоваров.Характеристика,
	|	ВложенныйЗапрос.СтроительнаяРабота,
	|	ТаблицаТоваров.Количество,
	|	ТаблицаТоваров.ДокументПоступления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Номенклатура КАК Номенклатура,
	|	ВрТаб.Характеристика КАК Характеристика,
	|	ВрТаб.Работа КАК Работа,
	|	ВрТаб.Количество КАК Количество,
	|	ТабПоДокументам.ДокументПоступления КАК ДокументПоступления,
	|	ТабПоДокументам.Количество КАК КоличествоПоступления,
	|	ТабПоДокументам.КоличествоПлан КАК КоличествоПлан,
	|	ВрТаб.КоличествоНоменклатуры КАК КоличествоНоменклатуры
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТабПоДокументам КАК ТабПоДокументам
	|		ПО ВрТаб.Номенклатура = ТабПоДокументам.Номенклатура
	|			И ВрТаб.Характеристика = ТабПоДокументам.Характеристика
	|			И ВрТаб.Работа = ТабПоДокументам.СтроительнаяРабота
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабПоДокументам.ДокументПоступления КАК ДокументПоступления,
	|	ТабПоДокументам.Номенклатура КАК Номенклатура,
	|	ТабПоДокументам.Характеристика КАК Характеристика,
	|	СУММА(ТабПоДокументам.Количество) КАК КоличествоПоступления
	|ИЗ
	|	ТабПоДокументам КАК ТабПоДокументам
	|
	|СГРУППИРОВАТЬ ПО
	|	ТабПоДокументам.ДокументПоступления,
	|	ТабПоДокументам.Номенклатура,
	|	ТабПоДокументам.Характеристика";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	
	ТаблицаПоступлений = ПакетЗапросов[3].Выгрузить();
	
	
	ТЗ = ПакетЗапросов[2].Выгрузить();
	
	СтруктураОтбора = Новый Структура("ДокументПоступления",null);
	
	ТаблицаНоменклатурыБезЗАказов = ТЗ.Скопировать(СтруктураОтбора);
	
	СтрокиБезНоменклатуры = ТЗ.НайтиСтроки(СтруктураОтбора);
	
	Для Каждого НайденнаяСтрока ИЗ СтрокиБезНоменклатуры Цикл
		
		ТЗ.Удалить(НайденнаяСтрока);
		
	КонецЦикла;
	
	СтруктураОтбора = Новый Структура("Номенклатура,Характеристика");
	
	Для Каждого СтрокаТаблицы ИЗ ТаблицаНоменклатурыБезЗАказов Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,СтрокаТаблицы);
				
		ТаблицаОтбора = ТаблицаПоступлений.Скопировать(СтруктураОтбора);
		ТаблицаОтбора.Свернуть("ДокументПоступления,КоличествоПоступления");
		
		Для Каждого НайденнаяСтрока ИЗ ТаблицаОтбора Цикл
			
			Нстр = ТЗ.Добавить();
			
			ЗаполнитьЗначенияСвойств(Нстр,СтрокаТаблицы);
			Нстр.ДокументПоступления = НайденнаяСтрока.ДокументПоступления;
			Нстр.КоличествоПоступления = НайденнаяСтрока.КоличествоПоступления;

			
			ТабТоваров = Нстр.ДокументПоступления.Товары.Выгрузить().Скопировать(СтруктураОтбора);
			Нстр.КоличествоПоступления = Мин(ТабТоваров.Итог("Количество"),НайденнаяСтрока.КоличествоПоступления);			
			
		КонецЦикла;  	
		
	КонецЦикла;
	
	ТабДокументов = ТаблицаПоступлений.Скопировать();
	ТабДокументов.Свернуть("ДокументПоступления");
	
	МассивДокументовДляПроведения = Новый Массив;
	
	СтруктураОтбора = Новый Структура("ДокументПоступления");
	
	Для Каждого СтрокаДокументов ИЗ ТабДокументов Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора,СтрокаДокументов);
		
		ДокументОбъект = СтрокаДокументов.ДокументПоступления.ПолучитьОбъект();
		ДокументОбъект.УСОERP_РаспределениеМатериаловПоРаботам.Очистить();
		
		Строки = ТЗ.НайтиСтроки(СтруктураОтбора);
		
		Для Каждого НайденнаяСтрока ИЗ Строки Цикл
			
			Нстр = ДокументОбъект.УСОERP_РаспределениеМатериаловПоРаботам.Добавить();
			Нстр.ОбъектСтроительства = ОбъектСтроительства;
			Нстр.СтроительнаяРабота = НайденнаяСтрока.Работа;
			Нстр.ДатаПоступления = ДокументОбъект.Дата;
			Нстр.Номенклатура = НайденнаяСтрока.Номенклатура;
			Нстр.Характеристика = НайденнаяСтрока.Характеристика;
			Нстр.Количество = НайденнаяСтрока.Количество*НайденнаяСтрока.КоличествоПоступления/НайденнаяСтрока.КоличествоНоменклатуры;
			
		КонецЦикла;
		
		//Заполняем разницы при округлении
		ТабТекущегоДокумента = ДокументОбъект.УСОERP_РаспределениеМатериаловПоРаботам.Выгрузить();
		ТабТекущегоДокумента.Свернуть("Номенклатура,Характеристика","Количество");
		
		СтруктураОтбораПоДокументу = Новый Структура("ДокументПоступления,Номенклатура,Характеристика",СтрокаДокументов.ДокументПоступления);
		СтруктураОтбораПоНоменклатуре  = Новый Структура("Номенклатура,Характеристика");
				
		Для Каждого СтрокаТД ИЗ ТабТекущегоДокумента Цикл
			
			ЗаполнитьЗначенияСвойств(СтруктураОтбораПоДокументу,СтрокаТД);
			ЗаполнитьЗначенияСвойств(СтруктураОтбораПоНоменклатуре,СтрокаТД);
			
			СтрокаДокумента = ТЗ.НайтиСтроки(СтруктураОтбораПоДокументу).Получить(0);
			
			Если СтрокаТД.Количество <> СтрокаДокумента.КоличествоПоступления Тогда
				
				СтрокаДляИзменения =  ДокументОбъект.УСОERP_РаспределениеМатериаловПоРаботам.НайтиСтроки(СтруктураОтбораПоНоменклатуре).Получить(0);
				
				СтрокаДляИзменения.Количество = СтрокаДляИзменения.Количество-(СтрокаТД.Количество-СтрокаДОкумента.КоличествоПоступления);
				
			КонецЕсли; 			
			
		КонецЦикла;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(); 
		МассивДокументовДляПроведения.Добавить(ДокументОбъект.Ссылка);
		
	КонецЦикла;
	
	Для Каждого ЭлементМассива ИЗ   МассивДокументовДляПроведения Цикл
		
		Попытка
			ЭлементМассива.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить("Не удалось провести документ "+ЭлементМассива+" ("+ОписаниеОшибки()+")");
		КонецПопытки;		
		
	КонецЦикла;	
	
	ЗаполнитьТаблицуДокументов();
	ЗаполнитьДеревоДанныхНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеренестиВДокументы(Команда)
	
	КомандаПеренестиВДокументыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьТаблицуДокументов(Команда)
	
	ЗаполнитьТаблицуДокументов();
	ЗаполнитьДеревоДанныхНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекСтрока = Элементы.ТаблицаДокументов.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		ПоказатьЗначение(,ТекСтрока.Документ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДокументовОтборПриИзменении(Элемент)
	ДеревоДанных.ПолучитьЭлементы().Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		
		Период.Вариант = ВариантСтандартногоПериода.Вчера;
		ДатаПотребности = КонецМесяца(ТекущаяДата());
		ТолькоНераспределенные = Истина;
		
	КонецЕсли;
	
	ЗаполнитьТаблицуДокументов();
	ЗаполнитьДеревоДанныхНаСервере();
	
КонецПроцедуры
